---
kind: property
id: P:Autodesk.Revit.DB.ConfigurationReloadInfo.ProfileNotAvailable
source: html/ee8c3b23-3e4c-bb09-94cf-f05475dbb754.htm
---
# Autodesk.Revit.DB.ConfigurationReloadInfo.ProfileNotAvailable Property

The current profile is not available in the disk configuration.

## Syntax (C#)
```csharp
public bool ProfileNotAvailable { get; }
```